---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures
source: html/e0abe33f-94f2-752e-c8b0-a2f990b4f9be.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures

Failures description ColumnInsideWall

## Syntax (C#)
```csharp
public static class ColumnInsideWallFailures
```